# txt='І смеркає, і світає, День божий минає, І знову люд потомлений. І все спочиває. Тільки я, мов окаянний, І день і ніч плачу. На розпуттях велелюдних, І ніхто не бачить, І не бачить, і не знає — Оглухли, не чують; Кайданами міняються, Правдою торгують. І господа зневажають, — Людей запрягають. В тяжкі ярма. Орють лихо, Лихом засівають. А що вродить? Побачите, Які будуть жнива! Схаменіться, недолюди, Діти юродивії, Подивіться на рай тихий, На свою країну! Полюбіте щирим серцем Велику руїну! Розкуйтеся, братайтеся! У чужому краю Не шукайте, не питайте того, що немає. І на небі, а не тільки. На чужому полі.'
def main():
     text = input(str("текст: "))
     v=input('варіант(а/b): ')
     leterss = ["а","б","в","г","д","є","ж","з","и","і","ї","й","к","л","м","н","о","п","р","с","т","у","ф","х","ц","ч","ш","щ","ь","ю","я","a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z"]
     if v=='a':
         text = text.lower()
         numbers = []
         print ('всього символів: ' , len(text))
         for leter in leterss:
              numbers.append(text.count(leter))
         for i in range(-1,len(leterss)):
              print(f"{leterss[i]}:{numbers[i]}")
         print(':)')
         main()
     elif v=='b':
          #забираю коми)
          text1=text.replace(',', '')
          text2=text1.replace('.', '')
          text3=text2.replace(';', '')
          text4=text3.replace(':', '')
          text5=text4.replace('?', '')
          text6=text5.replace('!', '')
          # роблю список
          textspl=text6.split()
          # сортую
          textsplsort=textspl.sort()
          # забираю подвоєні числа
          textsplsortap = list(dict.fromkeys(textspl))
          # прінтую циклом
          print('CЛОВА:')
          for word in textspl:
               if len(word) > 2:
                   print(word)
          print(':)')
          main()
     else:
          print(':(')
          main()
if __name__ == '__main__':
	main()